workout-planner-backend/app/controllers/application_controller.rb

    def get_user
      User.find(decode_token(get_token)["user_id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def current_user
      user ||= User.find_by(id: get_user)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]