workout-planner-backend/app/controllers/assignments_controller.rb

SELECT "assignments".* FROM "assignments"
INSERT INTO "assignments" ("assigned_by", "assigned_to", "user_id", "workout_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["assigned_by", "1"], ["assigned_to", "rahul@gmail.com"], ["user_id", 1], ["workout_id", 9], ["created_at", "2023-09-06 09:24:39.138376"], ["updated_at", "2023-09-06 09:24:39.138376"]]
INSERT INTO "assignments" ("assigned_by", "assigned_to", "user_id", "workout_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["assigned_by", "1"], ["assigned_to", "anike@gmail.com"], ["user_id", 1], ["workout_id", 10], ["created_at", "2023-09-06 09:14:54.573674"], ["updated_at", "2023-09-06 09:14:54.573674"]]
---
    def assignUser
        @allAsignment = Assignment.all
        @canAssign = true
        @allAsignment.each do |a|
        @assignedTos = Assignment.where( assigned_to: params[:assigned_to])
        @assignedBys = Assignment.where(params[:assigned_by])
        if params[:assigned_to]== a[:assigned_to]
            if params["workout_id"].to_i == a[:workout_id].to_i
              @canAssign = false
            end
          end
        end
        if @canAssign
            @assignment = Assignment.create(assignment_params)
            if @assignment.save

SELECT "assignments".* FROM "assignments" WHERE "assignments"."assigned_to" = ?  [["assigned_to", "shiv@gmail.com"]]
SELECT "workouts".* FROM "workouts"
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" IN (?, ?)  [["id", 9], ["id", 10]]
---
    def assignedWorkouts
        if logged_in?
            @user= get_user
            @assignments = Assignment.where(assigned_to:@user[:email])
            @workouts =Workout.all
            @workout_ids =[]
            for w in @assignments
                @workout_ids.append(w[:workout_id])
            end
            @assignedWorkouts = Workout.where(id: @workout_ids)