workout-planner-backend/app/controllers/comments_controller.rb

    def addComment
        @comment = Comment.new(comments_params)
        if @comment.save
            user = User.find_by(email:comments_params[:author])
---
INSERT INTO "comments" ("author", "body", "workout_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "2"], ["body", "Nice"], ["workout_id", 9], ["created_at", "2023-09-06 11:22:12.564256"], ["updated_at", "2023-09-06 11:22:12.564256"]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "shiv@gmail.com"], ["LIMIT", 1]]

    def getAllComments
        @comments = Comment.where(workout_id:params[:id])
        @allComments = []
        for c in @comments
            user = User.find_by(email:c[:author])
---
SELECT "comments".* FROM "comments" WHERE "comments"."workout_id" = ?  [["workout_id", 27]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "shiv@gmail.com"], ["LIMIT", 1]]