workout-planner-backend/app/controllers/registrations_controller.rb

INSERT INTO "users" ("name", "email", "role", "password_digest", "password_confirmation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
      @user = User.new(reg_params)
      if @user.save