workout-planner-backend/app/controllers/sessions_controller.rb

  def userAuthentication
    token = request.headers["Authorization"]
    user = User.find(decode(token)["user_id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def userInfo
    user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]