workout-planner-backend/app/controllers/workouts_controller.rb

INSERT INTO "workouts" ("title", "workout_date", "workout_desc", "workout_type", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @workout = Workout.new(workout_params)
        if @workout.save

SELECT "workouts".* FROM "workouts" WHERE "workouts"."workout_type" = ?  [["workout_type", "Public"]]
---
    def allworkout
        if logged_in?
            @workouts = Workout.where(workout_type:"Public")

SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = ?  [["user_id", 4]]
---
    def myworkouts
        if logged_in?
            @user= get_user
            @workouts = Workout.where(user_id:@user[:id])

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
    def workoutDetail
        if logged_in?
            @user= get_user
            @canEdit = false
            @canDelete = false
            @workout = Workout.find(params[:id])

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
UPDATE "workouts" SET "workout_date" = ?, "workout_desc" = ?, "updated_at" = ? WHERE "workouts"."id" = ?  [["workout_date", "2023-09-09 17:17:00"], ["workout_desc", "Plan 1 by shiv edited"], ["updated_at", "2023-09-08 11:47:15.095068"], ["id", 25]]
---
    def update
        if logged_in?
            @workout= Workout.find(params[:id])
            if @workout
                @workout.update(workout_params)

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."workout_id" = ?  [["workout_id", 22]]
DELETE FROM "assignments" WHERE "assignments"."id" = ?  [["id", 11]]
SELECT "comments".* FROM "comments" WHERE "comments"."workout_id" = ?  [["workout_id", 22]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 18]]
DELETE FROM "workouts" WHERE "workouts"."id" = ?  [["id", 22]]
---
    def destroy
        @workout=Workout.find_by(id:params[:id])
        @assignments = Assignment.where(workout_id: @workout[:id])
        for assignment in @assignments
            assignment.destroy
        end
        @comments = Comment.where(workout_id:@workout[:id])
        for comment in @comments
            comment.destroy
        end
        @workout.destroy